Documents/CRM_ЗаписьНаСервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>CRM_ЗаписьНаСервис</Name>
			<BasedOn>
				<xr:Item>Document.CRM_КоммерческоеПредложение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRM_ЗаписиНаСервис</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдатьНапоминание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КилометражНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийРезультата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_МаршрутыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказОтАнкетирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательНапоминания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЛист</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыТестДрайва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестДрайва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыТестДрайвов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТопливоНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыКомментариев</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ПлановыеРезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CRM_ОценкаУдовлетворенностиКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/CRM_ЗаписиНаСервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_ЗаписиНаСервис</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_ЗаписьНаСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/CRM_ЗаписьНаСервис/Ext/ObjectModule.bsl
// Общий журнал

Перем Права Экспорт;



Функция ПолучитьСписокПечатныхФорм(ДокументСсылка = Неопределено) Экспорт
	Возврат Новый СписокЗначений();	
КонецФункции
//Конец необходимых для общих журналов

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("ДатаПроведения", ДатаПроведения);
	//	Запрос.УстановитьПараметр("Начало", Начало);
	//	Запрос.УстановитьПараметр("Конец", Начало + (Продолжительность-1)*60);
	//	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ЗаписьНаТестДрайв.Ссылка,
	//	|	ЗаписьНаТестДрайв.Начало,
	//	|	ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность) КАК Конец
	//	|ИЗ
	//	|	Документ.CRM_ЗаписьНаТестДрайв КАК ЗаписьНаТестДрайв
	//	|ГДЕ
	//	|	ЗаписьНаТестДрайв.ДатаПроведения = &ДатаПроведения
	//	|	И (ЗаписьНаТестДрайв.Начало МЕЖДУ &Начало И &Конец
	//	|			ИЛИ ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1) МЕЖДУ &Начало И &Конец
	//	|			ИЛИ &Начало МЕЖДУ ЗаписьНаТестДрайв.Начало И ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1)
	//	|			ИЛИ &Конец МЕЖДУ ЗаписьНаТестДрайв.Начало И ДОБАВИТЬКДАТЕ(ЗаписьНаТестДрайв.Начало, МИНУТА, ЗаписьНаТестДрайв.Продолжительность - 1))
	//	|	И ЗаписьНаТестДрайв.Автомобиль = &Автомобиль
	//	|	И ЗаписьНаТестДрайв.Ссылка <> &Ссылка
	//	|	И ЗаписьНаТестДрайв.ПометкаУдаления = ЛОЖЬ";
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если НЕ РезультатЗапроса.Пустой() Тогда
	//		Выборка = РезультатЗапроса.Выбрать();
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Имеются пересечения с уже ведёнными данными:";
	//		Пока Выборка.Следующий() Цикл
	//			Сообщение.Текст = Сообщение.Текст + Символы.ПС + Строка(Выборка.Ссылка) + " : " + Формат(Выборка.Начало, "ДФ=ЧЧ:мм") + " - " + Формат(Выборка.Конец, "ДФ=ЧЧ:мм");
	//		КонецЦикла;
	//		Сообщение.Текст = Сообщение.Текст + Символы.ПС + "Проведение документа невозможно.";
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//	КонецЕсли;
	//
	//	Если СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно ИЛИ
	//		СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Отменено Тогда
	//		
	//		Если ПустаяСтрока(ПричинаОтмены) Тогда
	//			Сообщение = Новый СообщениеПользователю;
	//			Сообщение.Поле = "ПричинаОтмены";
	//			Сообщение.УстановитьДанные(ЭтотОбъект);
	//			Сообщение.Текст = "Не заполнена причина отмены";
	//			Сообщение.Сообщить();
	//			Отказ = Истина;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//
	//	Если СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.Завершено 
	//		ИЛИ СтатусДокумента = Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно Тогда
	//		
	//		//Если КодыКомментариев.Количество() = 0 И НЕ ОтказОтАнкетирования Тогда
	//		//	
	//		//	Отказ = Истина;
	//		//	Сообщение = Новый СообщениеПользователю;
	//		//	Сообщение.Поле = "ОтказОтАнкетирования";
	//		//	Сообщение.УстановитьДанные(ЭтотОбъект);
	//		//	Сообщение.Текст = "Для сохранения документа с данным статусом необходимо либо заполнить анкету либо проставить отказ от анкетирования";
	//		//	Сообщение.Сообщить();
	//		//	
	//		//КонецЕсли;
	//		
	//	КонецЕсли;
	//
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.CRM_ЗаписиНаСервис.Очистить();
	
	Движение = Движения.CRM_ЗаписиНаСервис.Добавить();
	
	Движение.Регистратор = Ссылка;
	
	Движение.Автомобиль = Автомобиль;
	Движение.Менеджер = Менеджер;
	ДатаВремяПроведения = ДатаПроведения + Час(Начало)*3600 + Минута(Начало)*60;
	Движение.ДатаНачала = ДатаВремяПроведения;
	Движение.Клиент = Клиент;
	Движение.Документ = Ссылка;
	
	Движения.CRM_ЗаписиНаСервис.Записывать = Истина;
	
	////Временно
	//Движение = Движения.CRM_ПроведенныйТестДрайв.Добавить();
	//Движение.Регистратор = Ссылка;
	//Движение.IDK = РабочийЛист;
	//Движение.МодельАвтомобиля = Автомобиль.Модель;
	//Движение.Сотрудник = Менеджер;
	//Движение.Дата = ДатаВремяПроведения;
	//Движение.Подразделение = Подразделение;
	//Движение.Отдел = Отдел;
	//Движение.ФИО = Клиент;
	//Движения.CRM_ПроведенныйТестДрайв.Записывать = Истина;
	//
	//Для Каждого Стр Из КодыКомментариев Цикл
	//	Движение = Движения.CRM_РезультатыКонтактов.Добавить();
	//	Движение.Регистратор = Ссылка;
	//	Движение.Автомобиль = Автомобиль;
	//	Движение.Сотрудник = Менеджер;
	//	Движение.Показатель = Стр.Показатель;
	//	Движение.ОценкаУдовлетворенности = Стр.Результат;
	//КонецЦикла;
	//Если Движения.CRM_РезультатыКонтактов.Количество() > 0 Тогда
	//	Движения.CRM_РезультатыКонтактов.Записывать = Истина;
	//КонецЕсли;
	//
	////Очистим имеющиеся напоминания
	//УдалитьИмеющиесяНапоминания();
	////Запишем напоминание
	//Если ВыдатьНапоминание И СтатусДокумента <> Перечисления.CRM_СтатусыТестДрайва.Завершено И СтатусДокумента <> Перечисления.CRM_СтатусыТестДрайва.ЗавершеноДосрочно Тогда
	//	РегМенеджер = РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
	//	РегМенеджер.Пользователь = ПользовательНапоминания;
	//	РегМенеджер.Автор = Автор;
	//	РегМенеджер.Объект = Ссылка;
	//	РегМенеджер.Тема = "Тест-драйв";
	//	РегМенеджер.Описание = "Начало в "+ Формат(Начало, "ДФ=ЧЧ:мм") + ", клиент " + Клиент.Наименование + ", тел.: " + Renault_УправлениеКонтактнойИнформацией.ТелефонКлиента(Клиент);
	//	РегМенеджер.РеальнаяДатаОповещения = ДатаПроведения + Час(ВремяНапоминания)*3600 + Минута(ВремяНапоминания)*60;
	//	РегМенеджер.Записать(Истина);
	//КонецЕсли;
	//
	////Запишем изменение статуса
	//ПредыдущийСтатус = РегистрыСведений.CRM_СтатусыТД.ПолучитьПоследнее(, Новый Структура("ТестДрайв", Ссылка));
	//Если НЕ ПредыдущийСтатус.Статус = СтатусДокумента Тогда
	//	РегМенеджер = РегистрыСведений.CRM_СтатусыТД.СоздатьМенеджерЗаписи();
	//	РегМенеджер.Период = ТекущаяДата();
	//	РегМенеджер.ТестДрайв = Ссылка;
	//	РегМенеджер.Статус = СтатусДокумента;
	//	РегМенеджер.Записать(Истина)
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.CRM_ЗаписиНаСервис.Очистить();
		
КонецПроцедуры

Процедура УдалитьИмеющиесяНапоминания()
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	Напоминания.Пользователь,
	//|	Напоминания.Автор,
	//|	Напоминания.Завершено,
	//|	Напоминания.РеальнаяДатаОповещения,
	//|	Напоминания.Объект
	//|ИЗ
	//|	РегистрСведений.Напоминания КАК Напоминания
	//|ГДЕ
	//|	Напоминания.Объект = &Ссылка";
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	РегМенеджер 						= РегистрыСведений.Напоминания.СоздатьМенеджерЗаписи();
	//	РегМенеджер.Пользователь 			= Выборка.Пользователь;
	//	РегМенеджер.Автор 					= Выборка.Автор;
	//	РегМенеджер.Завершено 				= Выборка.Завершено;
	//	РегМенеджер.РеальнаяДатаОповещения	= Выборка.РеальнаяДатаОповещения;
	//	РегМенеджер.Объект 					= Выборка.Объект;
	//	РегМенеджер.Удалить();
	//КонецЦикла;
		
КонецПроцедуры
